TexasInstruments/motor-control-sdk/examples/position_sense/endat_diagnostic/single_channel/am261x-lp/r5fss0-0_freertos/example.syscfg
section13.load_memory                 = "R5F_TCMB";
section13.$name                       = "Command Response";
section13.output_section.create(1);
section13.output_section[0].$name     = ".gEnDatChInfo";
section13.output_section[0].alignment = 4;

endat1.$name                               = "CONFIG_ENDAT0";
endat1.PRU_Slice                           = "PRU0";
endat1.Booster_Pack                        = true;
endat1["PRU-ICSS1"].$assign                = "PRU-ICSS1";
endat1["PRU-ICSS1"].PR1_PRU0_GPIO2.$assign = "GPIO83";
endat1["PRU-ICSS1"].PR1_PRU0_GPIO1.$assign = "GPIO82";
endat1["PRU-ICSS1"].PR1_PRU0_GPIO0.$assign = "GPIO81";
endat1["PRU-ICSS1"].PR1_PRU0_GPIO9.$assign = "GPIO80";
endat1.ENC1_EN.$name                       = "ENDAT0_BP_POWER_EN0";
endat1.ENC1_EN.GPIO_n.$assign              = "GPIO21";

pruicss1.$name                           = "CONFIG_PRU_ICSS0";
endat1.pru                               = pruicss1;
pruicss1.AdditionalICSSSettings[0].$name = "CONFIG_PRU_ICSS_IO1";
pruicss1.intcMapping.create(1);
pruicss1.intcMapping[0].$name            = "CONFIG_ICSS1_INTC_MODE1_MAPPING0";
pruicss1.intcMapping[0].event            = "21";

epwm_syncout_xbar1.$name      = "CONFIG_EPWM_SYNCOUT_XBAR0";
epwm_syncout_xbar1.xbarOutput = ["EPWM0_SYNCOUT"];

soc_timesync_xbar11.$name      = "CONFIG_SOC_TIMESYNC_XBAR1_0";
soc_timesync_xbar11.xbarOutput = "SOC_TIMESYNC_XBAR1_PWM_SYNCOUT_XBAR_OUT_0";
soc_timesync_xbar11.instance   = "SOC_TIMESYNC_XBAR1_ICSS_MODULE_0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution = "GPIO43";
epwm1.EPWM.B.$suggestSolution = "GPIO44";
